<a href="https://colab.research.google.com/github/sebasruggero/python/blob/main/ETL_Sube.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![img](https://www.argentina.gob.ar/sites/default/files/min_transporte.png)
![img](https://upload.wikimedia.org/wikipedia/commons/5/50/Sube_logo_blanco.png)


# ETL - Sube
### Lic. Sebastian Ruggero

# Extraccion

## Importamos las librerias

In [ ]:
import numpy as np
import pandas as pd 
import os
!pip install --user tables

Collecting tables
  Using cached tables-3.7.0-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (5.9 MB)
Collecting numexpr>=2.6.2
  Using cached numexpr-2.8.1-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (381 kB)
Requirement already satisfied: numpy>=1.19.0 in /home/sebastian/anaconda3/envs/python-gis/lib/python3.8/site-packages (from tables) (1.22.3)
Requirement already satisfied: packaging in /home/sebastian/anaconda3/envs/python-gis/lib/python3.8/site-packages (from tables) (21.3)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in /home/sebastian/anaconda3/envs/python-gis/lib/python3.8/site-packages (from packaging->tables) (3.0.7)
Installing collected packages: numexpr, tables
  WARNING: The scripts pt2to3, ptdump, ptrepack and pttree are installed in '/home/sebastian/.local/bin' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed numexpr-2.8.1 tables-3.7.0

## Definimos el directorio de las fuentes de datos.

In [ ]:
os.chdir("/home/sebastian/data_science/sube")

## Leemos la data y verificamos algunas variables

In [ ]:
df = pd.read_csv("data/file.csv", sep=";", nrows= 2_000_000,index_col=False)

In [ ]:
df.head()

,CODIGOENTIDAD,IDLINEA,NROCHIP,NROTARJETA,CODIGOCONTRATO,SECUENCIA_TARJETA,FECHATRX,MONTO,SALDO,VALOR_TARIFA,...,EMISOR_MONEDERO,SECCION_FIN,SECCION_INICIO,DESCUENTO,PROVISION,ID_POSICIONAMIENTO,PTC,LTC,ID_COMBINACION,DESCUENTO_ITG
0,435,NaN,4087763771,1704911567,602,583,09/01/2022 09:44:16,500.0,740.62,500.0,...,5,NaN,NaN,0.0,NaN,0,558,0,NaN,NaN
1,435,NaN,36128809661985284,1831398991,602,1744,09/01/2022 09:49:35,500.0,640.59,500.0,...,5,NaN,NaN,0.0,NaN,0,1740,1,NaN,NaN
2,435,NaN,3296295979,1703944868,602,283,09/01/2022 12:01:49,200.0,223.91,200.0,...,5,NaN,NaN,0.0,NaN,0,195,0,NaN,NaN
3,435,NaN,880099183,1814806757,602,1096,09/01/2022 18:10:56,100.0,102.74,100.0,...,5,NaN,NaN,0.0,NaN,0,1089,0,NaN,NaN
4,435,NaN,1033964559,1817903537,602,2253,09/01/2022 19:43:41,200.0,312.04,200.0,...,5,NaN,NaN,0.0,NaN,0,2250,3,NaN,NaN

In [ ]:
df.dtypes

CODIGOENTIDAD             int64
IDLINEA                 float64
NROCHIP                   int64
NROTARJETA                int64
CODIGOCONTRATO            int64
SECUENCIA_TARJETA         int64
FECHATRX                 object
MONTO                   float64
SALDO                   float64
VALOR_TARIFA            float64
INTERNO                   int64
DISPOSITIVO               int64
SECTERMINAL               int64
CODIGOTIPOTRX             int64
CODIGOSUBTIPOTRX          int64
TIPOMAPPING               int64
ENTIDAD_EMISORA_TARJ      int64
CODIGOERROR               int64
FECHAPROCESO             object
RAMAL                     int64
IDARCHIVOINTERCAMBIO      int64
CODIGOROL                object
CODIGOTIPOTARJETA         int64
SENTIDO                 float64
MONEDERO_ID               int64
EMISOR_CONTRATO           int64
SAM_ID                    int64
LG_ID                   float64
TIPO_TERMINAL             int64
ID_SERVICIO             float64
VERSION_TIPO_TRX          int64
ID_INTEGRADOR             int64
EMISOR_MONEDERO           int64
SECCION_FIN             float64
SECCION_INICIO          float64
DESCUENTO               float64
PROVISION               float64
ID_POSICIONAMIENTO        int64
PTC                       int64
LTC                       int64
ID_COMBINACION          float64
DESCUENTO_ITG           float64
dtype: object

# Transformacion

## Creamos las columnas Time alternativa

In [ ]:
df['FECHATRX_1'] =  pd.to_datetime(df.FECHATRX, errors='ignore')

In [ ]:
df['FECHATRX_2'] = pd.to_datetime(df["FECHATRX_1"]).dt.strftime('%m-%d-%Y')

In [ ]:
df.dtypes

CODIGOENTIDAD                    int64
IDLINEA                        float64
NROCHIP                          int64
NROTARJETA                       int64
CODIGOCONTRATO                   int64
SECUENCIA_TARJETA                int64
FECHATRX                        object
MONTO                          float64
SALDO                          float64
VALOR_TARIFA                   float64
INTERNO                          int64
DISPOSITIVO                      int64
SECTERMINAL                      int64
CODIGOTIPOTRX                    int64
CODIGOSUBTIPOTRX                 int64
TIPOMAPPING                      int64
ENTIDAD_EMISORA_TARJ             int64
CODIGOERROR                      int64
FECHAPROCESO                    object
RAMAL                            int64
IDARCHIVOINTERCAMBIO             int64
CODIGOROL                       object
CODIGOTIPOTARJETA                int64
SENTIDO                        float64
MONEDERO_ID                      int64
EMISOR_CONTRATO                  int64
SAM_ID                           int64
LG_ID                          float64
TIPO_TERMINAL                    int64
ID_SERVICIO                    float64
VERSION_TIPO_TRX                 int64
ID_INTEGRADOR                    int64
EMISOR_MONEDERO                  int64
SECCION_FIN                    float64
SECCION_INICIO                 float64
DESCUENTO                      float64
PROVISION                      float64
ID_POSICIONAMIENTO               int64
PTC                              int64
LTC                              int64
ID_COMBINACION                 float64
DESCUENTO_ITG                  float64
FECHATRX_1              datetime64[ns]
AÑO                              int64
MES                              int64
DIA                              int64
HORA                             int64
NUMERODIA                        int64
FECHATRX_2                      object
dtype: object

In [ ]:
df['AÑO'] = df["FECHATRX_1"].dt.year 
df['MES'] = df['FECHATRX_1'].dt.day
df['DIA'] = df['FECHATRX_1'].dt.month
df['HORA'] = df['FECHATRX_1'].dt.hour
df['NUMERODIA'] = df['FECHATRX_1'].dt.dayofweek

In [ ]:
df.head(1)

,CODIGOENTIDAD,IDLINEA,NROCHIP,NROTARJETA,CODIGOCONTRATO,SECUENCIA_TARJETA,FECHATRX,MONTO,SALDO,VALOR_TARIFA,...,LTC,ID_COMBINACION,DESCUENTO_ITG,FECHATRX_1,AÑO,MES,DIA,HORA,NUMERODIA,FECHATRX_2
0,435,NaN,4087763771,1704911567,602,583,09/01/2022 09:44:16,500.0,740.62,500.0,...,0,NaN,NaN,2022-09-01 09:44:16,2022,1,9,9,3,09-01-2022

## Armamos el nuevo dataframe y reindexamos

In [ ]:
df_subset = df.loc[:,["FECHATRX_2","AÑO", "MES", "DIA", "HORA","NUMERODIA","NROTARJETA", "CODIGOCONTRATO", "SECUENCIA_TARJETA", "MONTO", "SALDO", "VALOR_TARIFA"]]

In [ ]:
df_subset = df_subset.reindex(columns=["FECHATRX_2","AÑO", "MES", "DIA", "HORA","NUMERODIA","NROTARJETA", "CODIGOCONTRATO", "SECUENCIA_TARJETA", "MONTO", "SALDO", "VALOR_TARIFA"])

In [ ]:
df_subset.dtypes

FECHATRX_2            object
AÑO                    int64
MES                    int64
DIA                    int64
HORA                   int64
NUMERODIA              int64
NROTARJETA             int64
CODIGOCONTRATO         int64
SECUENCIA_TARJETA      int64
MONTO                float64
SALDO                float64
VALOR_TARIFA         float64
dtype: object

## Cambiamos el tipo de datos

In [ ]:
df_subset['AÑO'] = df_subset['AÑO'].apply(np.int32)
df_subset['MES'] = df_subset['MES'].apply(np.int16)
df_subset['DIA'] = df_subset['DIA'].apply(np.int16)
df_subset['NUMERODIA'] = df_subset['DIA'].apply(np.int16)
df_subset['NROTARJETA'] = df_subset['NROTARJETA'].apply(np.int32)
df_subset['CODIGOCONTRATO'] = df_subset['CODIGOCONTRATO'].apply(np.int32)
df_subset['SECUENCIA_TARJETA'] = df_subset['SECUENCIA_TARJETA'].apply(np.int32)
df_subset['VALOR_TARIFA'] = df_subset['VALOR_TARIFA'].apply(np.int32)

In [ ]:
df_subset.dtypes

FECHATRX_2            object
AÑO                    int32
MES                    int16
DIA                    int16
HORA                   int64
NUMERODIA              int16
NROTARJETA             int32
CODIGOCONTRATO         int32
SECUENCIA_TARJETA      int32
MONTO                float64
SALDO                float64
VALOR_TARIFA           int32
dtype: object

In [ ]:
df_subset.head()

,FECHATRX_2,AÑO,MES,DIA,HORA,NUMERODIA,NROTARJETA,CODIGOCONTRATO,SECUENCIA_TARJETA,MONTO,SALDO,VALOR_TARIFA
0,09-01-2022,2022,1,9,9,9,1704911567,602,583,500.0,740.62,500
1,09-01-2022,2022,1,9,9,9,1831398991,602,1744,500.0,640.59,500
2,09-01-2022,2022,1,9,12,9,1703944868,602,283,200.0,223.91,200
3,09-01-2022,2022,1,9,18,9,1814806757,602,1096,100.0,102.74,100
4,09-01-2022,2022,1,9,19,9,1817903537,602,2253,200.0,312.04,200

## Salvamos el archivo

In [ ]:
df_subset.to_csv("output/salida.csv")

In [ ]:
%time
df_subset.to_hdf("output/salida.h5", key="s")

CPU times: user 6 µs, sys: 0 ns, total: 6 µs
Wall time: 12.9 µs

## Tablas

- Acumulado Anual

In [ ]:
tabla_año = df_subset.groupby("AÑO").count()

In [ ]:
tabla_año.FECHATRX

,FECHATRX_2,MES,DIA,HORA,NUMERODIA,NROTARJETA,CODIGOCONTRATO,SECUENCIA_TARJETA,MONTO,SALDO,VALOR_TARIFA
AÑO,,,,,,,,,,,
2021,6024,6024,6024,6024,6024,6024,6024,6024,6024,6024,6024
2022,1993976,1993976,1993976,1993976,1993976,1993976,1993976,1993976,1993976,1993976,1993976

- Acumulado Mensual

In [ ]:
tabla_dia = df.groupby("NUMERODIA").count()

In [ ]:
tabla_dia.FECHATRX_1

NUMERODIA
0    208320
1    152806
2     75458
3    339670
4    449123
5    623468
6    151155
Name: FECHATRX_1, dtype: int64